"""
机器人学课程 Dofbot 机械臂基于改进DH参数法的正 / 逆运动学建模
"""

# --------------------- 1. 导入常用库 ---------------------
import roboticstoolbox as rtb   # 机器人专用工具箱
import numpy as np              # 矩阵运算

# --------------------- 2. 常量定义 ---------------------
pi = 3.1415926          # 自己指定 π，方便后续打印保留 7 位小数
# 连杆长度（单位：m，与实物一致）
l1 = 0.1045             # 连杆1长度（基座→关节2）
l2 = 0.08285            # 连杆2长度（关节2→关节3）
l3 = 0.08285            # 连杆3长度（关节3→关节4）
l4 = 0.12842            # 连杆4长度（关节4→末端）

# ==============================================
# 用改进 DH 法建立机器人模型Demo
# ==============================================
# RevoluteMDH(a, alpha, d, offset)
# 默认 theta 为关节变量，因此只写常数项即可
DH_demo = rtb.DHRobot(
    [
        rtb.RevoluteMDH(d=l1),                              # 关节1：绕 z 旋转，d 向上偏移 l1
        rtb.RevoluteMDH(alpha=-pi/2, offset=-pi/3),         # 关节2：x 向下扭转 90°，初始偏置 -90°
        rtb.RevoluteMDH(a=l2, offset = pi / 6),                              # 关节3：平移 l2
        rtb.RevoluteMDH(a=l3, offset=pi * 2 / 3),                 # 关节4：平移 l3，初始偏置 +90°
        rtb.RevoluteMDH(alpha=pi/2, d=l4)                   # 关节5：x 向上扭转 90°，末端延伸 l4
    ],
    name="DH_demo"       # 给机器人起个名字，打印时更直观
)

# 打印标准 DH 参数表（alpha、a、d、theta、offset）
print("========== DH_demo机器人 DH 参数 ==========")
print(DH_demo)

# --------------------- 零位验证 ---------------------
fkine_input0 = [0, 0, 0, 0, 0]          # 全部关节置 0
fkine_result0 = DH_demo.fkine(fkine_input0)
print("\n零位正解齐次变换矩阵:")
print(fkine_result0)
DH_demo.plot(q=fkine_input0, block=True) # 3D 可视化（阻塞模式）

# ==============================================
# 仿真任务0、 用改进 DH 法建立Dofbot机器人模型
# ==============================================
# RevoluteMDH(a, alpha, d, offset)
# 默认 theta 为关节变量，因此只写常数项即可
dofbot = rtb.DHRobot(
    [
        rtb.RevoluteMDH(a = 1, alpha=11, d=111, offset=1111),
        rtb.RevoluteMDH(),
        rtb.RevoluteMDH(),
        rtb.RevoluteMDH(),
        rtb.RevoluteMDH()
    ],
    name="Dofbot"
)

# 打印标准 DH 参数表（alpha、a、d、theta、offset）
print("========== Dofbot机器人 DH 参数 ==========")
print(dofbot)

# --------------------- 4. Part0 零位验证 ---------------------
fkine_input0 = [0, 0, 0, 0, 0]          # 全部关节置 0
fkine_result0 = dofbot.fkine(fkine_input0)
print("\n零位正解齐次变换矩阵:")
print(fkine_result0)
dofbot.plot(q=fkine_input0, block=True) # 3D 可视化（阻塞模式）

# ==============================================
# 仿真任务1、 正运动学 —— 给出DH模型在以下 4 组关节角下的正运动学解
# ==============================================
# poses = [
#     [0., pi/3, pi/4, pi/5, 0.],            # demo
#     [pi/2, pi/5, pi/5, pi/5, pi],          # 1
#     [pi/3, pi/4, -pi/3, -pi/4, pi/2],      # 2
#     [-pi/2, pi/3, -2*pi/3, pi/3, pi/3]     # 3
# ]

# -------- 1.1 demo  pose ----------
q_demo = [0., pi/3, pi/4, pi/5, 0.]
T_demo = dofbot.fkine(q_demo)
print("\n========== Part1-0 (demo) 正解 ==========")
print(T_demo)
dofbot.plot(q=q_demo, block=True)

# -------- 1.2 pose 1 ----------





# -------- 1.3 pose 2 ----------






# -------- 1.4 pose 3 ----------






# ==============================================
# 仿真任务2、 逆运动学 —— 给出DH模型在以下 4 组笛卡尔空间姿态下的逆运动学解
# ==============================================
# targets = [
#     # demo
#     np.array([
#         [-1., 0., 0., 0.1],
#         [ 0., 1., 0., 0. ],
#         [ 0., 0.,-1.,-0.1],
#         [ 0., 0., 0., 1. ]
#     ]),
#     # 1
#     np.array([
#         [1., 0., 0., 0.1],
#         [0., 1., 0., 0. ],
#         [0., 0., 1., 0.1],
#         [0., 0., 0., 1. ]
#     ]),
#     # 2
#     np.array([
#         [cos(pi/3), 0.,-sin(pi/3), 0.2],
#         [0.,        1., 0.,        0. ],
#         [sin(pi/3), 0., cos(pi/3), 0.2],
#         [0.,        0., 0.,        1. ]
#     ]),
#     # 3
#     np.array([
#         [-0.866, -0.25,  -0.433, -0.03704],
#         [ 0.5,   -0.433, -0.75,  -0.06415],
#         [ 0.,    -0.866,  0.5,    0.3073 ],
#         [ 0.,     0.,     0.,     1.     ]
#     ])
# ]

# -------- 2.1 demo 目标 ----------
T_des_demo = np.array([
    [-1., 0., 0., 0.1],
    [ 0., 1., 0., 0. ],
    [ 0., 0.,-1.,-0.1],
    [ 0., 0., 0., 1. ]
])
q_ik_demo = dofbot.ik_LM(T_des_demo)[0]   # 取返回元组第 0 个元素
print("\n========== Part2-0 (demo) 逆解 ==========")
print("关节角（rad）：", np.array(q_ik_demo))
dofbot.plot(q=q_ik_demo, block=True)

# -------- 2.2 目标 1 ----------






# -------- 2.3 目标 2 ----------






# -------- 2.4 目标 3 ----------






# ==============================================
# 仿真任务3、 工作空间可视化（≥500 点）
#     关节限位（°）→ 弧度
#     J1: [-180, 180]  J2~J5: [0, 180]
# ==============================================


